import random as rd

Variant = 27
rd.seed(Variant+735)

count = rd.randint(500, 1000)

methods = ["Треды (clone), куча","Процессы (fork) анонимное отображение" ]

list_actions = ["Среднее арифметическое значение (округленное до целого)","Медиана (округленная до целого)", 
                "Количество чисел кратных пяти", "Третье после максимального", "Пятое после миниманого", "Количество простых", 
               "Количество чисел, сумма цифр  которых кратна 3", "0.75 квантиль", 
                "Наиболее часто встречающаяся цифра в случайных числах",
               "Наиболее редко встречающаяся цифра в случайных числах"]

print([count, rd.sample(methods, 1), rd.sample(list_actions, 4)])